**DESCRIPTION:**

This Jupyter Notebook shows the data cleaning of fixture in the Qatar 2022 World Cup and world cup matches from 1930 to 2018. Once the process is finished both be saved as a csv file for its data exploration and model creation.

# 3. Data cleaning

**Library**

In [1]:
import pandas as pd

## 3.1 Cleaning DataFrame "df_fixture_data"

In [2]:
# DataFrame
df_fixture_data = pd.read_csv('data/FIFA_Worldcup_2022_Qatar.csv')
df_fixture_data

          First_team     Score       Second_team  Year
0             Qatar    Match 1           Ecuador  2022
1           Senegal    Match 2       Netherlands  2022
2             Qatar   Match 18           Senegal  2022
3       Netherlands   Match 19           Ecuador  2022
4           Ecuador   Match 35           Senegal  2022
..               ...       ...               ...   ...
59  Winners Match 51  Match 59  Winners Match 52  2022
60  Winners Match 57  Match 61  Winners Match 58  2022
61  Winners Match 59  Match 62  Winners Match 60  2022
62   Losers Match 61  Match 63   Losers Match 62  2022
63  Winners Match 61  Match 64  Winners Match 62  2022

[64 rows x 4 columns]

In [3]:
print(f'DataFrame "df_fixture_data" has {df_fixture_data.shape[0]}\
 rows and {df_fixture_data.shape[1]} columns.')

DataFrame "df_fixture_data" has 64 rows and 4 columns.

### 3.1.1 Removing blank spaces

In [4]:
df_fixture_data['First_team'] = df_fixture_data.First_team.str.strip()
df_fixture_data['Second_team'] = df_fixture_data.Second_team.str.strip()

### 3.1.2 Missing values

In [5]:
df_fixture_data.isnull().sum()

# There are no missing values in any column

First_team     0
Score          0
Second_team    0
Year           0
dtype: int64

In [6]:
df_fixture_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64 entries, 0 to 63
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   First_team   64 non-null     object
 1   Score        64 non-null     object
 2   Second_team  64 non-null     object
 3   Year         64 non-null     int64
dtypes: int64(1), object(3)
memory usage: 2.1+ KB

## 3.2 Cleaning DataFrame "df_historical_data"

In [7]:
# DataFrame 'pyarrow'
df_historical_data = pd.read_csv('data/FIFA_Worldcup_historical_data.csv', 
                                 engine='python', 
                                 encoding='utf-8', 
                                 #on_bad_lines=True,
                                )
df_historical_data

     First_team         Score Second_team  Year
0       France            4–1      Mexico  1930
1    Argentina            1–0      France  1930
2        Chile            3–0      Mexico  1930
3        Chile            1–0      France  1930
4    Argentina            6–3      Mexico  1930
..          ...           ...         ...   ...
896     Russia   2–2 (a.e.t.)     Croatia  2018
897     France            1–0     Belgium  2018
898    Croatia   2–1 (a.e.t.)     England  2018
899    Belgium            2–0     England  2018
900     France            4–2     Croatia  2018

[901 rows x 4 columns]

In [8]:
print(f'DataFrame "df_historical_data" has {df_historical_data.shape[0]}\
 rows and {df_historical_data.shape[1]} columns.')

DataFrame "df_historical_data" has 901 rows and 4 columns.

### 3.2.1 Missing values

In [9]:
df_historical_data.isnull().sum()

# There are no missing values

First_team     0
Score          0
Second_team    0
Year           0
dtype: int64

In [10]:
df_historical_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 901 entries, 0 to 900
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   First_team   901 non-null    object
 1   Score        901 non-null    object
 2   Second_team  901 non-null    object
 3   Year         901 non-null    int64
dtypes: int64(1), object(3)
memory usage: 28.3+ KB

### 3.2.2 Duplicate rows

In [11]:
df_historical_data.duplicated().sum()

0

In [12]:
# Delete duplicate rows
df_historical_data.drop_duplicates(inplace=True)

### 3.2.3 Deleting unplayed matches
'w/o[a]' : walkover at

In [13]:
# Indexes of unplayed matches (Walkover)
index_values= df_historical_data[df_historical_data.Score == 'w/o[a]'].index
index_values

Int64Index([37], dtype='int64')

In [14]:
# Delete unplayed games
df_historical_data.drop(index=index_values, 
                        inplace=True
                       )

# Now there are 900 rows left.

In [15]:
df_historical_data.shape

(900, 4)

### 3.2.4 Cleaning "Score" column
'(a.e.t)' : after extra time

In [16]:
# Rows containing column "Score" with '(a.e.t)'
df_historical_data[df_historical_data.Score.str.contains('[\\(a.e.t.)]', regex=True)]

       First_team         Score      Second_team  Year
24       Austria   3–2 (a.e.t.)           France  1934
27         Italy   1–1 (a.e.t.)            Spain  1934
34         Italy   2–1 (a.e.t.)   Czechoslovakia  1934
35   Switzerland   1–1 (a.e.t.)          Germany  1938
38          Cuba   3–3 (a.e.t.)          Romania  1938
..            ...           ...              ...   ...
887        Spain   1–1 (a.e.t.)           Russia  2018
888      Croatia   1–1 (a.e.t.)          Denmark  2018
892     Colombia   1–1 (a.e.t.)          England  2018
896       Russia   2–2 (a.e.t.)          Croatia  2018
898      Croatia   2–1 (a.e.t.)          England  2018

[68 rows x 4 columns]

In [17]:
# Replace string " (a.e.t)" with ""
df_historical_data.Score = df_historical_data.Score.str.replace('[\\ (a.e.t.)]', '', regex=True)

In [18]:
df_historical_data

     First_team Score Second_team  Year
0       France    4–1      Mexico  1930
1    Argentina    1–0      France  1930
2        Chile    3–0      Mexico  1930
3        Chile    1–0      France  1930
4    Argentina    6–3      Mexico  1930
..          ...   ...         ...   ...
896     Russia    2–2     Croatia  2018
897     France    1–0     Belgium  2018
898    Croatia    2–1     England  2018
899    Belgium    2–0     England  2018
900     France    4–2     Croatia  2018

[900 rows x 4 columns]

In [19]:
df_historical_data.Score.unique(), len(df_historical_data.Score.unique())

(array(['4–1', '1–0', '3–0', '6–3', '3–1', '2–1', '4–0', '6–1', '4–2',
        '3–2', '7–1', '5–2', '1–1', '6–0', '3–3', '6–5', '2–0', '8–0',
        '5–1', '2–2', '5–0', '9–0', '8–3', '7–0', '7–2', '4–4', '7–5',
        '1–3', '7–3', '0–0', '5–3', '0–1', '4–3', '0–3', '0–2', '1–4',
        '0–7', '1–2', '1–5', '10–1', '2–3', '3–4', '2–4', '0–4', '2–5',
        '1–7'], dtype=object),
 46)

In [20]:
df_historical_data[df_historical_data.Score.str.contains('[\\ ()]', regex=True)]

# There's no data with " (a.e.t)"

Empty DataFrame
Columns: [First_team, Score, Second_team, Year]
Index: []

### 3.2.5 Removing blank spaces from df_historical_data

In [21]:
df_historical_data['First_team'] = df_historical_data.First_team.str.strip()
df_historical_data['Score'] = df_historical_data.Score.str.strip()
df_historical_data['Second_team'] = df_historical_data.Second_team.str.strip()

In [22]:
df_historical_data.Score.unique(), len(df_historical_data.Score.unique())

(array(['4–1', '1–0', '3–0', '6–3', '3–1', '2–1', '4–0', '6–1', '4–2',
        '3–2', '7–1', '5–2', '1–1', '6–0', '3–3', '6–5', '2–0', '8–0',
        '5–1', '2–2', '5–0', '9–0', '8–3', '7–0', '7–2', '4–4', '7–5',
        '1–3', '7–3', '0–0', '5–3', '0–1', '4–3', '0–3', '0–2', '1–4',
        '0–7', '1–2', '1–5', '10–1', '2–3', '3–4', '2–4', '0–4', '2–5',
        '1–7'], dtype=object),
 46)

In [23]:
df_historical_data

    First_team Score Second_team  Year
0       France   4–1      Mexico  1930
1    Argentina   1–0      France  1930
2        Chile   3–0      Mexico  1930
3        Chile   1–0      France  1930
4    Argentina   6–3      Mexico  1930
..         ...   ...         ...   ...
896     Russia   2–2     Croatia  2018
897     France   1–0     Belgium  2018
898    Croatia   2–1     England  2018
899    Belgium   2–0     England  2018
900     France   4–2     Croatia  2018

[900 rows x 4 columns]

### 3.2.6 Splitting the "Score" column

In [24]:
df_historical_data

    First_team Score Second_team  Year
0       France   4–1      Mexico  1930
1    Argentina   1–0      France  1930
2        Chile   3–0      Mexico  1930
3        Chile   1–0      France  1930
4    Argentina   6–3      Mexico  1930
..         ...   ...         ...   ...
896     Russia   2–2     Croatia  2018
897     France   1–0     Belgium  2018
898    Croatia   2–1     England  2018
899    Belgium   2–0     England  2018
900     France   4–2     Croatia  2018

[900 rows x 4 columns]

In [25]:
# Create two columns with the goals of each team from the "Score" column.
df_historical_data[['First_team_goals','Second_team_goals']] = df_historical_data.Score.str.split('–', expand=True)

In [26]:
df_historical_data.head()

  First_team Score Second_team  Year First_team_goals Second_team_goals
0     France   4–1      Mexico  1930                4                 1
1  Argentina   1–0      France  1930                1                 0
2      Chile   3–0      Mexico  1930                3                 0
3      Chile   1–0      France  1930                1                 0
4  Argentina   6–3      Mexico  1930                6                 3

In [27]:
# Remove "Score" column
df_historical_data.drop(columns='Score', inplace=True)

In [28]:
df_historical_data

    First_team Second_team  Year First_team_goals Second_team_goals
0       France      Mexico  1930                4                 1
1    Argentina      France  1930                1                 0
2        Chile      Mexico  1930                3                 0
3        Chile      France  1930                1                 0
4    Argentina      Mexico  1930                6                 3
..         ...         ...   ...              ...               ...
896     Russia     Croatia  2018                2                 2
897     France     Belgium  2018                1                 0
898    Croatia     England  2018                2                 1
899    Belgium     England  2018                2                 0
900     France     Croatia  2018                4                 2

[900 rows x 5 columns]

### 3.2.7 Rename columns

In [29]:
# Rename columns from a dictionary.
df_historical_data.rename(columns={'First_team':'FirstTeam', 
                                   'Second_team':'SecondTeam', 
                                   'First_team_goals': 'FirstTeamGoals',
                                   'Second_team_goals': 'SecondTeamGoals'},
                          inplace=True
                         )

In [30]:
df_historical_data

     FirstTeam SecondTeam  Year FirstTeamGoals SecondTeamGoals
0       France     Mexico  1930              4               1
1    Argentina     France  1930              1               0
2        Chile     Mexico  1930              3               0
3        Chile     France  1930              1               0
4    Argentina     Mexico  1930              6               3
..         ...        ...   ...            ...             ...
896     Russia    Croatia  2018              2               2
897     France    Belgium  2018              1               0
898    Croatia    England  2018              2               1
899    Belgium    England  2018              2               0
900     France    Croatia  2018              4               2

[900 rows x 5 columns]

### 3.2.8 Change data type

In [31]:
df_historical_data.dtypes

FirstTeam          object
SecondTeam         object
Year                int64
FirstTeamGoals     object
SecondTeamGoals    object
dtype: object

In [32]:
df_historical_data.columns

Index(['FirstTeam', 'SecondTeam', 'Year', 'FirstTeamGoals', 'SecondTeamGoals'], dtype='object')

In [33]:
# Columns: FirstTeamGoals and SecondTeamGoals to integer type
df_historical_data = df_historical_data.astype({'FirstTeamGoals':'int16', 
                                                'SecondTeamGoals':int}
                                              )

In [34]:
df_historical_data.dtypes

FirstTeam          object
SecondTeam         object
Year                int64
FirstTeamGoals      int16
SecondTeamGoals     int32
dtype: object

### 3.2.9 Verifying number of matches per worldcup

In [35]:
years = [y for y in range(1930, 2022, 4)]

print('Year   Matches')
for year in years:
    print(year, ' ',len(df_historical_data[df_historical_data.Year == year]))
    
# World Cups of 1942 and 1946 were not held.

Year   Matches
1930   18
1934   17
1938   18
1942   0
1946   0
1950   22
1954   26
1958   35
1962   32
1966   32
1970   32
1974   38
1978   38
1982   52
1986   52
1990   52
1994   52
1998   64
2002   64
2006   64
2010   64
2014   64
2018   64

## 3.3 Export clean DataFrames

In [36]:
# Save the clean DataFrames to csv file
df_fixture_data.to_csv('data/Fixture_data_clean.csv', index=False)
df_historical_data.to_csv('data/Historical_data_clean.csv', index=False)